insert into qiaopi.avatar (id, name, url)
values  (1, '头像1', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/avatar/avatar1.webp'),
        (2, '头像2', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/avatar/avatar2.webp'),
        (3, '头像3', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/avatar/avatar3.webp');

insert into qiaopi.font (id, name, preview_image, file_path, price)
values  (1, '侨草方正硬笔简', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/09.png', '方正字迹-洪俊硬笔行草简体.TTF', 100),
        (2, '侨情书简体', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/01.png', '不二情书字体.TTF', 100),
        (3, '侨艺楷体', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/03.png', '博洋楷体.TTF', 100),
        (4, '侨欧创意体', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/04.png', '博洋欧体.TTF', 250),
        (5, '侨草行书', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/05.png', '博洋草体二.TTF', 100),
        (6, '侨行流畅体', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/06.png', '博洋行书.TTF', 300),
        (7, '侨行书韵体', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/07.png', '博洋行书二.TTF', 200),
        (8, '侨楷经典体', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/08.png', '博洋行楷.TTF', 100),
        (9, '侨批北针行楷', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/02.png', '北方行书.TTF', 250),
        (10, '侨草方正硬笔繁', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/10.png', '方正字迹-洪俊硬笔行草繁体.TTF', 100),
        (11, '侨行豪放繁体', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/11.png', '方正字迹-豪放行书繁体.TTF', 150),
        (12, '侨行长江简体', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/12.png', '方正字迹-长江行书简体.TTF', 100),
        (13, '侨行汉书体', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/font/13.png', '蔡云汉繁体行书书法字体.TTF', 200);

insert into qiaopi.font_color (id, hex_code, rgb_value, description, preview_image, price)
values  (1, '#030303', 'RGB (102, 102, 102)', '墨色', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/color/01.png', 100),
        (2, '#A52328', 'RGB (165, 35, 39)', '朱砂色', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/color/02.png', 100),
        (3, '#F9E009', 'RGB (249, 224, 9)', '金色', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/color/03.png', 100),
        (4, '#FFFFFF', 'RGB(255,255,255)', '白色', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/color/04.png', 100);


insert into qiaopi.function_card (id, card_type, card_name, card_desc, card_preview_link, card_status, reduce_time, speed_rate, remark, price)
values  (0, 2, '立即送达卡', '立即送达', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/0.webp', 1, '-1', null, '减少时间卡', 188),
        (1, 1, '1.2倍加速卡', '加速1.2倍', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/1.2x.webp', 1, null, '1.2', '加速卡', 20),
        (2, 1, '1.5倍加速卡', '加速1.5倍', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/1.5x.webp', 1, null, '1.5', '加速卡', 45),
        (3, 1, '2倍加速卡', '加速2倍', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/2x.webp', 1, null, '2', '加速卡', 65),
        (4, 1, '3倍加速卡', '加速3倍', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/3x.webp', 1, null, '3', '加速卡', 95),
        (5, 2, '减30分钟卡', '减少30分钟', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/-0.5h.webp', 1, '30', null, '减少时间卡', 10),
        (6, 2, '减1小时卡', '减少1小时', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/-1h.webp', 1, '60', null, '减少时间卡', 20),
        (7, 2, '减2小时卡', '减少2小时', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/-2h.webp', 1, '120', null, '减少时间卡', 40),
        (8, 2, '减6小时卡', '减少6小时', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/-6h.webp', 1, '360', null, '减少时间卡', 70),
        (9, 2, '减12小时卡', '减少12小时', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/-12h.webp', 1, '720', null, '减少时间卡', 100),
        (10, 2, '减24小时卡', '减少24小时', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/card/-24h.webp', 1, '1440', null, '减少时间卡', 145);

insert into qiaopi.paper (id, name, preview_image, file_path, font_size, translate_x, translate_y, recipient_translate_x, recipient_translate_y, sender_translate_x, sender_translate_y, price, type)
values  (1, '思乡桥信纸', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/paper/01.png', '信纸1.png', '50', '185', '122', '170', '70', '800', '1370', 100, 1),
        (2, '金函传情纸', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/paper/02.png', '信纸2.png', '50', '185', '209', '170', '146', '750', '1300', 200, 1),
        (3, '归雁传书纸', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/paper/03.png', '信纸3.png', '50', '150', '100', '135', '50', '750', '1400', 100, 1),
        (4, '普通信纸', 'http://110.41.58.26:9000/qiaopi/qiaopi-images/paper/04.jpg', '普通信纸.png', '15', '40', '70', '350', '580', '30', '50', 100, 2);


insert into qiaopi.questions (id, set_id, set_sequence_id, content, option_a, option_b, option_c, option_d, correct_answer, explanation, create_user, create_time, update_user, update_time, remark)
values  (1, 1, 1, '战争期间，侨批的传递速度受到了怎样的影响？', '显著加快', '基本不变', '明显减慢', '完全中断', 'C', '战争通常会导致交通和通信受阻，从而减慢侨批的传递速度。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '战争'),
        (2, 1, 2, '哪些战争事件直接影响了侨批的传递路线？', '一战中的海上封锁', '二战中的太平洋战争', '越南战争的扩散', '以上都是', 'B', '二战中的太平洋战争直接影响了亚洲地区的交通和通信，包括侨批的传递。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '战争'),
        (3, 1, 3, '战争时期，侨批在维持海外华侨与家乡联系中扮演了什么角色？', '唯一的通信方式', '次要的汇款途径', '情感交流的补充', '战争信息的传递者', 'D', '侨批在战争时期是重要的通信和汇款方式，也是战争信息的传递者。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '战争'),
        (4, 1, 4, '战争如何改变了侨批内容中常见的主题和信息？', '增加了关于战争的讨论', '减少了家庭琐事的分享', '增加了对安全的担忧', '以上都是', 'A', '战争期间，侨批中关于战争的讨论和对安全的担忧增加。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '战争'),
        (5, 1, 5, '在战争背景下，侨批的安全性是如何得到保障的？', '通过加密信件内容', '使用特定的包装材料', '依赖于信任的传递网络', '以上都是', 'C', '战争时期，侨批的安全性依赖于多种措施，包括加密、特殊包装和信任网络。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '战争'),
        (6, 1, 6, '战争对侨批中汇款金额的波动有何影响？', '汇款金额显著增加', '汇款金额显著减少', '汇款金额保持稳定', '汇款金额波动与战争无关', 'B', '战争通常导致经济困难，从而减少侨批中的汇款金额。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '战争'),
        (7, 1, 7, '战争期间，侨批如何成为传递战争消息和家庭信息的桥梁？', '通过隐藏信息在信件中', '通过特定的符号和代码', '通过口头传递和记忆', '以上都是', 'A', '隐藏信息在信件中是一种常见的方式，以避免战争期间的审查。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '战争'),
        (8, 1, 8, '战争对侨批文化中水客角色的影响是什么？', '水客成为战争的直接参与者', '水客的角色被军事通信取代', '水客的作用变得更加重要', '水客的角色逐渐消失', 'C', '战争期间，水客的作用变得更加重要，因为他们是连接海外华侨和家乡的重要纽带。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '战争'),
        (9, 1, 9, '战争时期，侨批在支持家乡抗战中起到了哪些作用？', '提供了战略情报', '提供了经济支持', '提供了物资援助', '以上都是', 'B', '侨批主要通过提供经济支持来帮助家乡抗战。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '战争'),
        (10, 1, 10, '战争结束后，侨批的传递和内容有哪些显著的变化？', '传递速度加快', '汇款金额增加', '信件内容变得更加乐观', '以上都是', 'D', '战争结束后，侨批的传递和内容通常会有积极的变化。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-18 16:28:47', '战争'),
        (11, 2, 1, '侨批在缓解家乡贫穷中起到了哪些实际作用？', '提供了教育资金', '支持了基础设施建设', '促进了当地经济发展', '以上都是', 'D', '侨批在多方面帮助缓解家乡的贫穷状况。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '贫穷'),
        (12, 2, 2, '贫穷如何影响侨批的发送频率和汇款金额？', '发送频率增加，汇款金额减少', '发送频率减少，汇款金额增加', '发送频率和汇款金额都减少', '发送频率和汇款金额都增加', 'C', '贫穷通常导致发送频率和汇款金额都减少。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '贫穷'),
        (13, 2, 3, '侨批文化中，汇款如何被用于家乡的扶贫和教育投资？', '直接用于家庭日常开销', '投资于当地的教育项目', '用于改善医疗条件', '以上都是', 'B', '侨批中的汇款经常被用于投资于教育项目，以帮助扶贫。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '贫穷'),
        (14, 2, 4, '贫穷对侨批中信件内容的情感表达有何影响？', '增加了对家乡的担忧', '减少了对家乡的思念', '增加了对改善生活的渴望', '以上都是', 'A', '贫穷增加了侨批中对家乡的担忧和对改善生活的渴望。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '贫穷'),
        (15, 2, 5, '侨批如何反映不同历史时期家乡的贫穷状况？', '通过汇款金额的变化', '通过信件中对贫穷的描述', '通过侨批的发送频率', '以上都是', 'D', '侨批在多个层面反映了家乡的贫穷状况。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '贫穷'),
        (16, 2, 6, '在贫穷时期，侨批的传递费用是如何被承担的？', '完全由发件人承担', '完全由收件人承担', '由发件人和收件人共同承担', '由政府或慈善机构承担', 'A', '在贫穷时期，侨批的传递费用通常由发件人承担。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '贫穷'),
        (17, 2, 7, '侨批中有哪些常见的请求援助或描述贫穷生活的内容？', '直接请求金钱援助', '描述家中的困难情况', '表达对改善生活的希望', '以上都是', 'D', '侨批中包含了多种请求援助和描述贫穷生活的内容。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '贫穷'),
        (18, 2, 8, '贫穷如何促使侨批成为海外华侨与家乡之间的重要纽带？', '增加了侨批的情感价值', '加强了侨批的经济作用', '提高了侨批的社交重要性', '以上都是', 'D', '贫穷在多个方面加强了侨批作为纽带的重要性。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '贫穷'),
        (19, 2, 9, '侨批在改善家乡基础设施和生计中起到了哪些作用？', '提供了基础设施建设资金', '支持了当地产业发展', '促进了教育和技能培训', '以上都是', 'D', '侨批在多个方面帮助改善了家乡的基础设施和生计。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '贫穷'),
        (20, 2, 10, '侨批文化中，水客在传递侨批时如何确保汇款能够到达需要帮助的家庭成员手中？', '通过直接交付给指定家庭成员', '通过社区的监督和确认', '通过建立信任的传递网络', '以上都是', 'C', '水客通过建立信任的传递网络确保汇款的安全。', 'admin', '2024-10-17 13:28:24', 'admin', '2024-10-17 13:35:03', '贫穷');